In [21]:
import pandas as pd; 
import numpy as np; 
import matplotlib.pyplot as plt

In [25]:
#load the data
df = pd.read_csv('./bankstatements.csv')

In [27]:
df.head()

         date DrCr   amount    balance mode      name  Day  Month  Year  Tday
0  2022-01-01   Db  10000.0  473292.87  ATM       NaN    1      1  2022     1
1  2022-01-01   Db  10000.0  463292.87  ATM       NaN    1      1  2022     1
2  2022-01-02   Db    930.0  462362.87  UPI  AYUBRAJE    2      1  2022     2
3  2022-01-07   Db   2000.0  460362.87  UPI  ABUTALAH    7      1  2022     3
4  2022-01-10   Db   1000.0  459362.87  UPI  AGRAWALB   10      1  2022     4

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 509 entries, 0 to 508
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   date     509 non-null    object
 1   DrCr     509 non-null    object
 2   amount   509 non-null    float64
 3   balance  509 non-null    float64
 4   mode     509 non-null    object
 5   name     370 non-null    object
 6   Day      509 non-null    int64
 7   Month    509 non-null    int64
 8   Year     509 non-null    int64
 9   Tday     509 non-null    int64
dtypes: float64(2), int64(4), object(4)
memory usage: 39.9+ KB

In [30]:
df.describe()

,amount,balance,Day,Month,Year,Tday
count,509.000000,509.000000,509.000000,509.000000,509.000000,509.000000
mean,8736.453006,115873.671493,13.569745,6.163065,2022.489194,161.850688
std,27181.105774,136850.421744,9.168241,3.282459,0.500375,92.683683
min,1.000000,0.130000,1.000000,1.000000,2022.000000,1.000000
25%,400.000000,35345.130000,5.000000,3.000000,2022.000000,83.000000
50%,1120.000000,56645.670000,12.000000,6.000000,2022.000000,165.000000
75%,7000.000000,121341.470000,22.000000,9.000000,2023.000000,243.000000
max,360000.000000,473292.870000,31.000000,12.000000,2023.000000,313.000000

In [46]:
df.iloc[0:8, 0:5]

         date DrCr   amount    balance mode
0  2022-01-01   Db  10000.0  473292.87  ATM
1  2022-01-01   Db  10000.0  463292.87  ATM
2  2022-01-02   Db    930.0  462362.87  UPI
3  2022-01-07   Db   2000.0  460362.87  UPI
4  2022-01-10   Db   1000.0  459362.87  UPI
5  2022-01-10   Db   1800.0  457562.87  UPI
6  2022-01-10   Db   5000.0  452562.87  UPI
7  2022-01-10   Db   3000.0  449562.87  UPI

In [47]:
df.iloc[0:8, 0:3]

         date DrCr   amount
0  2022-01-01   Db  10000.0
1  2022-01-01   Db  10000.0
2  2022-01-02   Db    930.0
3  2022-01-07   Db   2000.0
4  2022-01-10   Db   1000.0
5  2022-01-10   Db   1800.0
6  2022-01-10   Db   5000.0
7  2022-01-10   Db   3000.0

In [49]:
df.isnull().sum()

date         0
DrCr         0
amount       0
balance      0
mode         0
name       139
Day          0
Month        0
Year         0
Tday         0
dtype: int64

In [53]:
# fill missing names with "UNKNOWN"
df['name'].fillna('UNKNOWN', inplace=True)

C:\Users\Work\AppData\Local\Temp\ipykernel_27652\3421796518.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['name'].fillna('UNKNOWN', inplace=True)

In [54]:
df.isnull().sum()

date       0
DrCr       0
amount     0
balance    0
mode       0
name       0
Day        0
Month      0
Year       0
Tday       0
dtype: int64